[
    {
        "title": "Harry Potter: Philosopher's Stone",
        "author": "JK.Rowling",
        "yearOfReleased": 1997,
        "genre": "Fantasy",
        "image": "https://www.usatoday.com/story/life/books/2013/02/12/harry-potter-new-book-covers/1914149/",
        "synopsis": "Harry Potter lives with his abusive aunt and uncle, Vernon and Petunia Dursley and their bullying son, Dudley. On Harry's eleventh birthday, a half-giant named Rubeus Hagrid personally delivers an acceptance letter to Hogwarts School of Witchcraft and Wizardry, revealing that Harry's parents, James and Lily Potter, were wizards. When Harry was one year old, an evil and powerful dark wizard, Lord Voldemort, murdered his parents. Harry survived Voldemort's killing curse that rebounded off his forehead and seemingly destroyed the Dark Lord, leaving a lightning bolt-shaped scar on his forehead. Unknown to Harry, he is famous in the wizarding world.",
        "status": "Available"
    },
    {
        "title": "Harry Potter: Chamber of Secrets",
        "author": "JK.Rowling",
        "yearOfReleased": 1998,
        "genre": "Fantasy",
        "image": "https://www.barnesandnoble.com/w/harry-potter-and-the-chamber-of-secrets-jk-rowling/1123509217",
        "synopsis": "While spending the summer at the Dursleys, twelve-year-old Harry Potter is visited by a house-elf named Dobby. He warns that Harry is in danger and must not return to Hogwarts. Harry refuses, so Dobby magically ruins Aunt Petunia and Uncle Vernon's dinner party. A furious Uncle Vernon locks Harry into his room in retaliation. The Ministry of Magic immediately sends a notice accusing Harry of performing underage magic and threatening dismissal from Hogwarts.",
        "status": "Available"
    },
    {
        "title": "Harry Potter: Prisoner of Azkaban",
        "author": "JK.Rowling",
        "yearOfReleased": 1999,
        "genre": "Fantasy",
        "image": "https://www.poptoys.pl/products/harry-potter-art-print-prisoner-of-azkaban-book-cover-artwork-limited-edition-42-x-30-cm-july-2021",
        "synopsis": "Thirteen-year-old Harry Potter spends another unhappy summer at the Dursleys. After Aunt Marge insults Harry and his deceased parents, an angry Harry accidentally inflates her. Fearing expulsion from Hogwarts, he runs away. On a dark street, a large black dog watches Harry. Startled, Harry stumbles backward, causing his wand to emit sparks. The Knight Bus, a vehicle that rescues stranded wizards, suddenly arrives. Harry goes to the Leaky Cauldron in Diagon Alley where Cornelius Fudge, the Minister for Magic, is waiting. Harry is not expelled but is asked to remain in Diagon Alley until school starts. While there, Harry reunites with best friends Ron Weasley and Hermione Granger. Mr Weasley warns Harry about the wizard Sirius Black, a convicted murderer who escaped Azkaban prison and is believed to be hunting down Harry.",
        "status": "Available"
    },
    {
        "title": "Harry Potter: Goblet of FIre",
        "author": "JK.Rowling",
        "yearOfReleased": 2000,
        "genre": "Fantasy",
        "image": "https://www.antikvariaat.eu/j-k-rowling-harry-potter-and-the-goblet-of-fire",
        "synopsis": "Throughout the three previous novels in the Harry Potter series, the main character, Harry Potter, has struggled with the difficulties of growing up and the added challenge of being a famed wizard. When Harry was a baby, Lord Voldemort, the most powerful dark wizard in history, killed Harry's parents but was mysteriously defeated after unsuccessfully trying to kill Harry, though his attempt left a lightning-shaped scar on Harry's forehead. This results in Harry's immediate fame and his being placed in the care of his abusive Muggle (non-magical) aunt and uncle, Petunia and Vernon Dursley, who have a son named Dudley.",
        "status": "Available"
    },
    {
        "title": "Harry Potter: Order of the Phoenix",
        "author": "JK.Rowling",
        "yearOfReleased": 2003,
        "genre": "Fantasy",
        "image": "https://scholastic.asia/en/books/harry-potter-and-order-phoenix-kk",
        "synopsis": "During the summer, Harry Potter and his cousin Dudley are attacked by Dementors. Forced to magically fend them off, Harry is expelled from Hogwarts, but his expulsion is postponed pending a hearing at the Ministry of Magic. A group of wizards belonging to the Order of the Phoenix whisk Harry off to Number 12, Grimmauld Place, Sirius Black's childhood home.",
        "status": "Available"
    },
    {
        "title": "Harry Potter: Half-Blood Prince",
        "author": "JK.Rowling",
        "yearOfReleased": 2005,
        "genre": "Fantasy",
        "image": "https://www.posterlounge.com/p/723114.html",
        "synopsis": "Severus Snape, a member of the Order of the Phoenix, meets with Narcissa Malfoy, Draco's mother, and her sister Bellatrix Lestrange, Lord Voldemort's supporter. Narcissa expresses concern that her son may not survive a mission that Voldemort has given him. Snape makes an Unbreakable Vow with Narcissa, swearing to assist Draco.",
        "status": "Available"
    },
    {
        "title": "Harry Potter: Deathly Hallows",
        "author": "JK.Rowling",
        "yearOfReleased": 2007,
        "genre": "Fantasy",
        "image": "https://www.pinterest.co.uk/pin/339810734385279775/",
        "synopsis": "Throughout the six previous novels in the series, the main character Harry Potter has struggled with the difficulties of adolescence along with being famous as the only person ever to survive the Killing Curse. The curse was cast by Tom Riddle, better known as Lord Voldemort, a powerful evil wizard who murdered Harry's parents and attempted to kill Harry as a baby, due to a prophecy which claimed Harry would be able to stop him. As an orphan, Harry was placed in the care of his Muggle (non-magical) relatives Petunia Dursley and Vernon Dursley, with their son Dudley Dursley.",
        "status": "Available"
    },
    {
        "title": "The Rainbow Troops",
        "author": "Andrea Hirata",
        "yearOfReleased": 2005,
        "genre": "Novel",
        "image": "https://soundcloud.com/tommy-hardianto/laskar-pelangi-nidji-cover",
        "synopsis": "Set in the Sumatran island of Belitong , a small school is on the verge of closing down due to having less than the minimum of 10 students. Fortunately a new student arrives at the 11th hour to allow the school to continue its operations. Yet, the school still faces hardships as there are short on funds. The students then concoct an idea to put on a performance during the local carnival.",
        "status": "Available"
    },
    {
        "title": "The Dreamer",
        "author": "Andrea Hirata",
        "yearOfReleased": 2006,
        "genre": "Novel",
        "image": "https://asianwiki.com/images/1/1d/The_Dreamer_indonesia-p1.jpg",
        "synopsis": "The Dreamer opens on the key image of the father of the protagonist Ikal in his Sunday best - a safari shirt with four pockets - on his bicycle; this is a leitmotiv which is only explained further into the film, dedicated affectionately to the parents of the producers, the director and the scriptwriter. In one of the many brilliant jumps in time and space that Riri Riza weaves into the film, we fast-forward to the image of an adult Ikal in the late 90s, unhappy in his job at a post office in Bogor. His dream of travelling the world and studying at the Sorbonne seems to be a lost cause; his cousin Arai, having led him on by fuelling his dreams, has now betrayed him, disappearing without a trace.",
        "status": "Available"
    },
    {
        "title": "It Ends with Us",
        "author": "Colleen Hoover",
        "yearOfReleased": 2016,
        "genre": "Romance",
        "image": "https://www.bookdepository.com/It-Ends-With-Us-Colleen-Hoover/9781398520783",
        "synopsis": "Lily hasn't always had it easy, but that's never stopped her from working hard for the life she wants. She's come a long way from the small town in Maine where she grew up — she graduated from college, moved to Boston, and started her own business. So when she feels a spark with a gorgeous neurosurgeon named Ryle Kincaid, everything in Lily's life suddenly seems almost too good to be true.",
        "status": "Available"
    },
    {
        "title": "It Starts with Us",
        "author": "Colleen Hoover",
        "yearOfReleased": 2022,
        "genre": "Romance",
        "image": "https://bookstobreathe.com/cover-reveal-it-starts-with-us-it-ends-with-us-2-by-colleen-hoover/",
        "synopsis": "Lily and her ex-husband, Ryle, have just settled into a civil coparenting rhythm when she suddenly bumps into her first love, Atlas, again. After nearly two years separated, she is elated that for once, time is on their side, and she immediately says yes when Atlas asks her on a date. But her excitement is quickly hampered by the knowledge that, though they are no longer married, Ryle is still very much a part of her life—and Atlas Corrigan is the one man he will hate being in his ex-wife and daughter's life.",
        "status": "Available"
    },
    {
        "title": "Reminders of Him",
        "author": "Colleen Hoover",
        "yearOfReleased": 2022,
        "genre": "Romance",
        "image": "https://www.goodreads.com/id/book/show/58341222-reminders-of-him",
        "synopsis": "A troubled young mother yearns for a shot at redemption in this heartbreaking yet hopeful story from #1 New York Times bestselling author Colleen Hoover. After serving five years in prison for a tragic mistake, Kenna Rowan returns to the town where it all went wrong, hoping to reunite with her four-year-old daughter. But the bridges Kenna burned are proving impossible to rebuild. Everyone in her daughter’s life is determined to shut Kenna out, no matter how hard she works to prove herself. The only person who hasn’t closed the door on her completely is Ledger Ward, a local bar owner and one of the few remaining links to Kenna’s daughter. But if anyone were to discover how Ledger is slowly becoming an important part of Kenna’s life, both would risk losing the trust of everyone important to them. The two form a connection despite the pressure surrounding them, but as their romance grows, so does the risk. Kenna must find a way to absolve the mistakes of her past in order to build a future out of hope and healing. ",
        "status": "Available"
    },
    {
        "title": "The Silent Patient",
        "author": "Alex Michaelides",
        "yearOfReleased": 2019,
        "genre": "Mystery",
        "image": "https://apkpure.com/ms/the-silent-patient-by-alex-michaelides-pdf-book/com.wTheSilentPatientbyAlexMichaelidesPDFBOOK_11015804",
        "synopsis": "Alicia Berenson’s life is seemingly perfect. A famous painter married to an in-demand fashion photographer, she lives in a grand house with big windows overlooking a park in one of London’s most desirable areas. One evening her husband Gabriel returns home late from a fashion shoot, and Alicia shoots him five times in the face, and then never speaks another word.",
        "status": "Available"
    },
    {
        "title": "The Shining",
        "author": "Stephen King",
        "yearOfReleased": 1977,
        "genre": "Horror and Thriller",
        "image": "https://id.pinterest.com/pin/297026537900664978/",
        "synopsis": "The Shining mainly takes place in the fictional Overlook Hotel, an isolated, haunted resort hotel located in the Colorado Rockies. The history of the hotel, which is described in backstory by several characters, includes the deaths of some of its guests and of former winter caretaker Delbert Grady, who “succumbed to cabin fever” and killed his family and himself.",
        "status": "Available"
    },
    {
        "title": "It",
        "author": "Stephen King",
        "yearOfReleased": 1986,
        "genre": "Horror and Thriller",
        "image": "https://stephenking.fandom.com/wiki/IT_%28book%29",
        "synopsis": "During a rainstorm in Derry, Maine, a six-year-old boy named Georgie Denbrough sails a paper boat along the rainy streets before it washes down into a storm drain. Looking in the drain, Georgie encounters a clown who introduces himself as Pennywise the Dancing Clown. Georgie is enticed by Pennywise to reach into the drain and retrieve his boat, where the clown rips his arm off, leaving him to die.",
        "status": "Available"
    },
    {
        "title": "Into the Wild",
        "author": "Jon Krakauer",
        "yearOfReleased": 1996,
        "genre": "Biography and Memoir",
        "image": "https://www.goodreads.com/book/show/1845.Into_the_Wild",
        "synopsis": "Christopher Johnson McCandless grew up in suburban Annandale, Virginia. After graduating in May 1990 with high grades from Emory University, McCandless ceased communicating with his family, gave away his college fund of $24,500 to Oxfam, and began traveling across the Western United States, later abandoning his 1982 Datsun B210 after a flash flood.",
        "status": "Available"
    },
    {
        "title": "One of Us Is Lying",
        "author": "Karen M. McManus",
        "yearOfReleased": 2017,
        "genre": "Young adult",
        "image": "https://www.goodreads.com/book/show/58679358-one-of-us-is-lying",
        "synopsis": "At Bayview High, Bronwyn, Simon, Nate, Cooper, and Addy attend detention with teacher Mr. Avery after he found mobile phones in each of their school bags, against the high school's no-phone policy. However, each of the students claims that the phones are not theirs and that someone played a prank on them. They hear a collision in the school parking lot, and Mr. Avery leaves to investigate. Simon—creator of the 'About That' gossip app in which the personal lives of students at Bayview High are posted for the rest of the school to see—begins a speech about the stereotypical personalities of the other four students and how he, through his app, is the omniscient narrator. He drinks water from a plastic cup and suffers a fatal allergic reaction due to his peanut allergy. The others attempt to help, but it is too late and Simon dies in the hospital.",
        "status": "Available"
    },
    {
        "title": "Charlotte's Web",
        "author": "E. B. White",
        "yearOfReleased": 1952,
        "genre": "Children's Fiction",
        "image": "https://bacaanbzee.wordpress.com/2013/05/30/charlottes-web/",
        "synopsis": "After a little girl named Fern Arable pleads for the life of the runt of a litter of piglets, her father gives her the pig to nurture, and she names him Wilbur. She treats him as a pet, but a month later, Wilbur is no longer small, and is sold to Fern's uncle, Homer Zuckerman. In Zuckerman's barnyard, Wilbur yearns for companionship, but is snubbed by the other animals. He is befriended by a barn spider named Charlotte, whose web sits in a doorway overlooking Wilbur's enclosure. When Wilbur discovers that he is being raised for slaughter, she promises to hatch a plan guaranteed to spare his life. Fern often sits on a stool, listening to the animals' conversation, but over the course of the story, as she starts to mature, she begins to find other interests.",
        "status": "Available"
    }
]